export const transactions = [
  { id: 1, date: "2026-03-20", time: "10:30", type: "تحويل أرباح دوري", amount: "2000 جنيه", status: "مكتمل", method: "تحويل بنكي" },
  { id: 2, date: "2026-03-18", time: "11:00", type: "تحويل أرباح دوري", amount: "1500 جنيه", status: "تم التحويل", method: "تحويل بنكي" },
  { id: 3, date: "2026-02-15", time: "09:45", type: "تحويل أرباح دوري", amount: "1800 جنيه", status: "قيد المراجعة", method: "تحويل بنكي" },
  { id: 4, date: "2026-02-10", time: "01:30", type: "تحويل أرباح دوري", amount: "2200 جنيه", status: "مرفوض", method: "تحويل بنكي" },
  { id: 5, date: "2026-02-05", time: "10:10", type: "تحويل أرباح دوري", amount: "2500 جنيه", status: "مكتمل", method: "تحويل بنكي" },

  { id: 6, date: "2026-01-28", time: "12:20", type: "تحويل أرباح دوري", amount: "1700 جنيه", status: "تم التحويل", method: "تحويل بنكي" },
  { id: 7, date: "2026-01-25", time: "08:15", type: "تحويل أرباح دوري", amount: "3000 جنيه", status: "مكتمل", method: "تحويل بنكي" },
  { id: 8, date: "2026-03-22", time: "02:40", type: "تحويل أرباح دوري", amount: "1200 جنيه", status: "قيد المراجعة", method: "تحويل بنكي" },
  { id: 9, date: "2026-01-20", time: "09:00", type: "تحويل أرباح دوري", amount: "2100 جنيه", status: "مكتمل", method: "تحويل بنكي" },
  { id: 10, date: "2026-01-15", time: "11:50", type: "تحويل أرباح دوري", amount: "1900 جنيه", status: "مرفوض", method: "تحويل بنكي" },

  { id: 11, date: "2026-01-10", time: "07:30", type: "تحويل أرباح دوري", amount: "2600 جنيه", status: "تم التحويل", method: "تحويل بنكي" },
  { id: 12, date: "2026-01-05", time: "03:10", type: "تحويل أرباح دوري", amount: "2800 جنيه", status: "مكتمل", method: "تحويل بنكي" },

  { id: 13, date: "2025-12-30", time: "10:00", type: "تحويل أرباح دوري", amount: "3200 جنيه", status: "مكتمل", method: "تحويل بنكي" },
  { id: 14, date: "2025-12-28", time: "01:20", type: "تحويل أرباح دوري", amount: "3000 جنيه", status: "مكتمل", method: "تحويل بنكي" },
  { id: 15, date: "2025-12-25", time: "11:15", type: "تحويل أرباح دوري", amount: "1400 جنيه", status: "قيد المراجعة", method: "تحويل بنكي" },
  { id: 16, date: "2025-12-20", time: "09:35", type: "تحويل أرباح دوري", amount: "1600 جنيه", status: "تم التحويل", method: "تحويل بنكي" },
  { id: 17, date: "2025-12-18", time: "08:25", type: "تحويل أرباح دوري", amount: "1800 جنيه", status: "مرفوض", method: "تحويل بنكي" },

  { id: 18, date: "2025-12-15", time: "02:10", type: "تحويل أرباح دوري", amount: "1200 جنيه", status: "قيد المراجعة", method: "تحويل بنكي" },
  { id: 19, date: "2025-12-10", time: "06:45", type: "تحويل أرباح دوري", amount: "2700 جنيه", status: "مكتمل", method: "تحويل بنكي" },
  { id: 20, date: "2025-12-05", time: "04:30", type: "تحويل أرباح دوري", amount: "2300 جنيه", status: "تم التحويل", method: "تحويل بنكي" },
  { id: 20, date: "2026-04-01", time: "04:30", type: "تحويل أرباح دوري", amount: "2300 جنيه", status: "تم التحويل", method: "تحويل بنكي" },
];